-- --------------------------------------------------------
-- Хост:                         127.0.0.1
-- Версия сервера:               10.11.4-MariaDB - mariadb.org binary distribution
-- Операционная система:         Win64
-- HeidiSQL Версия:              12.3.0.6589
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


-- Дамп структуры базы данных bank_bot
CREATE DATABASE IF NOT EXISTS `bank_bot` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci */;
USE `bank_bot`;

-- Дамп структуры для таблица bank_bot.accounts
CREATE TABLE IF NOT EXISTS `accounts` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `Account` decimal(20,0) NOT NULL,
  PRIMARY KEY (`Id`),
  UNIQUE KEY `Account` (`Account`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- Дамп данных таблицы bank_bot.accounts: ~1 rows (приблизительно)
INSERT INTO `accounts` (`Id`, `Account`) VALUES
	(12, 40702810902330003977);

-- Дамп структуры для таблица bank_bot.data
CREATE TABLE IF NOT EXISTS `data` (
  `Account_id` int(11) DEFAULT NULL,
  `Hash_1_1` decimal(20,0) NOT NULL,
  `Hash_1_2` decimal(20,0) NOT NULL,
  `Hash_2_1` decimal(20,0) NOT NULL,
  `Hash_2_2` decimal(20,0) NOT NULL,
  `Field_1` varchar(50) DEFAULT NULL,
  `Field_2` decimal(2,0) DEFAULT NULL,
  `Field_3` varchar(10) DEFAULT NULL,
  `Field_4` date NOT NULL,
  `Field_5` date DEFAULT NULL,
  `Field_6` date DEFAULT NULL,
  `Field_7` date DEFAULT NULL,
  `Field_8` varchar(200) DEFAULT NULL,
  `Field_9` time DEFAULT NULL,
  `Field_10` date DEFAULT NULL,
  `Field_11` varchar(50) DEFAULT NULL,
  `Field_12` decimal(2,0) DEFAULT NULL,
  `Field_13` varchar(1) DEFAULT NULL,
  `Field_14` varchar(200) DEFAULT NULL,
  `Field_15` varchar(30) NOT NULL,
  `Field_16` varchar(50) DEFAULT NULL,
  `Field_17` decimal(11,0) DEFAULT NULL,
  `Field_18` decimal(2,0) DEFAULT NULL,
  `Field_19` varchar(200) DEFAULT NULL,
  `Field_20` varchar(300) DEFAULT NULL,
  `Field_21` decimal(9,0) DEFAULT NULL,
  `Field_22` varchar(50) DEFAULT NULL,
  `Field_23` varchar(50) DEFAULT NULL,
  `Field_24` decimal(12,0) NOT NULL,
  `Field_25` decimal(9,0) DEFAULT NULL,
  `Field_26` decimal(20,0) DEFAULT NULL,
  `Field_27` decimal(20,0) DEFAULT NULL,
  `Field_28` decimal(20,0) NOT NULL,
  `Field_29` date DEFAULT NULL,
  `Field_30` decimal(20,0) DEFAULT NULL,
  `Field_31` varchar(50) DEFAULT NULL,
  `Field_32` decimal(2,0) DEFAULT NULL,
  `Field_33` decimal(10,0) DEFAULT NULL,
  `Field_34` varchar(1) DEFAULT NULL,
  `Field_35` varchar(300) DEFAULT NULL,
  `Field_36` decimal(9,0) DEFAULT NULL,
  `Field_37` varchar(50) DEFAULT NULL,
  `Field_38` varchar(50) DEFAULT NULL,
  `Field_39` decimal(12,0) NOT NULL,
  `Field_40` decimal(9,0) DEFAULT NULL,
  `Field_41` decimal(20,0) DEFAULT NULL,
  `Field_42` decimal(20,0) DEFAULT NULL,
  `Field_43` decimal(20,0) NOT NULL,
  `Field_44` varchar(25) DEFAULT NULL,
  `Field_45` decimal(5,0) DEFAULT NULL,
  `Field_46` date DEFAULT NULL,
  `Field_47` decimal(2,0) DEFAULT NULL,
  `Field_48` decimal(16,2) NOT NULL,
  `Field_49` varchar(100) DEFAULT NULL,
  `Field_50` varchar(100) DEFAULT NULL,
  `Field_51` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`Hash_1_1`,`Hash_1_2`,`Hash_2_1`,`Hash_2_2`),
  KEY `Account_id` (`Account_id`),
  CONSTRAINT `data_ibfk_1` FOREIGN KEY (`Account_id`) REFERENCES `accounts` (`Id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- Дамп данных таблицы bank_bot.data: ~3 rows (приблизительно)
INSERT INTO `data` (`Account_id`, `Hash_1_1`, `Hash_1_2`, `Hash_2_1`, `Hash_2_2`, `Field_1`, `Field_2`, `Field_3`, `Field_4`, `Field_5`, `Field_6`, `Field_7`, `Field_8`, `Field_9`, `Field_10`, `Field_11`, `Field_12`, `Field_13`, `Field_14`, `Field_15`, `Field_16`, `Field_17`, `Field_18`, `Field_19`, `Field_20`, `Field_21`, `Field_22`, `Field_23`, `Field_24`, `Field_25`, `Field_26`, `Field_27`, `Field_28`, `Field_29`, `Field_30`, `Field_31`, `Field_32`, `Field_33`, `Field_34`, `Field_35`, `Field_36`, `Field_37`, `Field_38`, `Field_39`, `Field_40`, `Field_41`, `Field_42`, `Field_43`, `Field_44`, `Field_45`, `Field_46`, `Field_47`, `Field_48`, `Field_49`, `Field_50`, `Field_51`) VALUES
	(12, 1645961624522085545, 4008806140066914658, 17323651093112737253, 2810797154072554274, NULL, 1, 'электронно', '2024-02-13', NULL, NULL, '2024-02-13', NULL, NULL, NULL, NULL, NULL, NULL, 'Размещение денежных средств во Вклад по Сделке № CB11302240006124 от 13.02.2024, без НДС', '62185', NULL, 0, 5, NULL, 'ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ "РЭДВЭЙ"', 44525593, 'АО "АЛЬФА-БАНК" г Москва', NULL, 9703070488, 770301001, 30101810200000000593, 40702810902330003977, 40702810902330003977, NULL, NULL, '0', 0, 0, NULL, 'ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ "РЭДВЭЙ"', 44525593, 'АО "АЛЬФА-БАНК" г Москва', NULL, 9703070488, 0, 30101810200000000593, 42102810702390010753, 42102810702390010753, 'Платежное поручение', NULL, NULL, NULL, -2000000.00, NULL, NULL, NULL),
	(12, 1944140799399270141, 11811967080113122839, 9187947380007899177, 16589320215757173162, NULL, 2, 'электронно', '2024-04-01', NULL, NULL, '2024-04-01', NULL, NULL, NULL, NULL, NULL, NULL, 'Комиссия за обсл.счета за период с 01.03.24 по 31.03.24 по ПУ "Лучший Старт" Осн.тарифы Банка,НДС не облаг. ООО "РЭДВЭЙ" за счет 40702156902330000058', '278816', NULL, 0, 5, NULL, 'ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ "РЭДВЭЙ"', 44525593, 'АО "АЛЬФА-БАНК" г Москва', NULL, 9703070488, 770301001, 30101810200000000593, 40702810902330003977, 40702810902330003977, NULL, NULL, '0', 0, 0, NULL, 'АО "АЛЬФА-БАНК"', 44525593, 'АО "АЛЬФА-БАНК" г Москва', NULL, 7728168971, 0, 30101810200000000593, 47423810202330012348, 47423810202330012348, 'Платежное требование', NULL, NULL, NULL, -1690.00, 'с акцептом', NULL, NULL),
	(12, 5063033883073092321, 16099140087443995328, 6333021834355915085, 17190941808974382343, NULL, 1, 'электронно', '2024-01-24', NULL, '2024-01-24', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'Взнос учредителя в Уставный капитал. НДС не облагается', '1161', NULL, 0, 5, NULL, 'Общество с ограниченной ответственностью "Евроинвест"', 44525555, 'ПАО "Промсвязьбанк" г Москва', NULL, 7728501735, 0, 30101810400000000555, 40702810800000048113, 40702810800000048113, NULL, NULL, '0', 0, 0, NULL, 'ООО "РЭДВЭЙ"', 44525593, 'АО "АЛЬФА-БАНК" г Москва', NULL, 9703070488, 0, 30101810200000000593, 40702810902330003977, 40702810902330003977, 'Платежное поручение', NULL, NULL, NULL, 2000000.00, NULL, NULL, NULL),
	(12, 5206352411540532038, 14038066411227502491, 14812808560972768840, 1529444221490580263, NULL, 2, 'электронно', '2024-05-01', NULL, NULL, '2024-05-01', NULL, NULL, NULL, NULL, NULL, NULL, 'Комиссия за обсл.счета за период с 01.04.24 по 30.04.24 по ПУ "Лучший Старт" Осн.тарифы Банка,НДС не облаг. ООО "РЭДВЭЙ" за счет 40702156902330000058', '163624', NULL, 0, 5, NULL, 'ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ "РЭДВЭЙ"', 44525593, 'АО "АЛЬФА-БАНК" г Москва', NULL, 9703070488, 770301001, 30101810200000000593, 40702810902330003977, 40702810902330003977, NULL, NULL, '0', 0, 0, NULL, 'АО "АЛЬФА-БАНК"', 44525593, 'АО "АЛЬФА-БАНК" г Москва', NULL, 7728168971, 0, 30101810200000000593, 47423810202330012348, 47423810202330012348, 'Платежное требование', NULL, NULL, NULL, -1690.00, 'с акцептом', NULL, NULL),
	(12, 8069226773532109063, 5474077026847113502, 8064011498305325080, 439634836439944548, NULL, 17, 'электронно', '2024-02-01', NULL, NULL, '2024-02-01', NULL, NULL, NULL, NULL, NULL, NULL, 'Комиссия за обсл.счета за период с 01.02.24 по 29.02.24 по ПУ "Лучший Старт" Осн.тарифы Банка,НДС не облаг. ООО "РЭДВЭЙ"', '4930', NULL, 0, 5, NULL, 'ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ "РЭДВЭЙ"', 44525593, 'АО "АЛЬФА-БАНК"', NULL, 9703070488, 770301001, 30101810200000000593, 40702810902330003977, 40702810902330003977, NULL, NULL, '0', 0, 0, NULL, 'АО "Альфа-Банк"', 44525593, 'АО "АЛЬФА-БАНК"', NULL, 7728168971, 770801001, 30101810200000000593, 47422810402390025079, 47422810402390025079, 'Банковский ордер', NULL, NULL, NULL, -690.00, NULL, NULL, NULL),
	(12, 8081931278741066879, 81842379970791456, 12141544478726584378, 16188871997142486451, NULL, 2, 'электронно', '2024-02-01', NULL, NULL, '2024-02-01', NULL, NULL, NULL, NULL, NULL, NULL, 'Комиссия за обсл.счета за период с 01.01.24 по 31.01.24 по ПУ "Лучший Старт" Осн.тарифы Банка,НДС не облаг. ООО "РЭДВЭЙ" за счет 40702156902330000058', '617209', NULL, 0, 5, NULL, 'ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ "РЭДВЭЙ"', 44525593, 'АО "АЛЬФА-БАНК" г Москва', NULL, 9703070488, 770301001, 30101810200000000593, 40702810902330003977, 40702810902330003977, NULL, NULL, '0', 0, 0, NULL, 'АО "АЛЬФА-БАНК"', 44525593, 'АО "АЛЬФА-БАНК" г Москва', NULL, 7728168971, 0, 30101810200000000593, 47423810202330012348, 47423810202330012348, 'Платежное требование', NULL, NULL, NULL, -1690.00, 'с акцептом', NULL, NULL),
	(12, 9994943590842206037, 5239909595190328602, 1691025002536541902, 9451899783466386959, NULL, 17, 'электронно', '2024-04-01', NULL, NULL, '2024-04-01', NULL, NULL, NULL, NULL, NULL, NULL, 'Комиссия за обсл.счета за период с 01.04.24 по 30.04.24 по ПУ "Лучший Старт" Осн.тарифы Банка,НДС не облаг. ООО "РЭДВЭЙ"', '4777', NULL, 0, 5, NULL, 'ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ "РЭДВЭЙ"', 44525593, 'АО "АЛЬФА-БАНК"', NULL, 9703070488, 770301001, 30101810200000000593, 40702810902330003977, 40702810902330003977, NULL, NULL, '0', 0, 0, NULL, 'АО "Альфа-Банк"', 44525593, 'АО "АЛЬФА-БАНК"', NULL, 7728168971, 770801001, 30101810200000000593, 47422810402390025079, 47422810402390025079, 'Банковский ордер', NULL, NULL, NULL, -690.00, NULL, NULL, NULL),
	(12, 11777120263451805325, 17615171420211509071, 9308774320678090350, 311584051240654206, NULL, 2, 'электронно', '2024-03-01', NULL, NULL, '2024-03-01', NULL, NULL, NULL, NULL, NULL, NULL, 'Комиссия за обсл.счета за период с 01.02.24 по 29.02.24 по ПУ "Лучший Старт" Осн.тарифы Банка,НДС не облаг. ООО "РЭДВЭЙ" за счет 40702156902330000058', '436011', NULL, 0, 5, NULL, 'ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ "РЭДВЭЙ"', 44525593, 'АО "АЛЬФА-БАНК" г Москва', NULL, 9703070488, 770301001, 30101810200000000593, 40702810902330003977, 40702810902330003977, NULL, NULL, '0', 0, 0, NULL, 'АО "АЛЬФА-БАНК"', 44525593, 'АО "АЛЬФА-БАНК" г Москва', NULL, 7728168971, 0, 30101810200000000593, 47423810202330012348, 47423810202330012348, 'Платежное требование', NULL, NULL, NULL, -1690.00, 'с акцептом', NULL, NULL),
	(12, 13518607738133044748, 4494162178489900292, 5974117648472718890, 2049714946215250695, NULL, 1, 'электронно', '2024-02-22', NULL, NULL, '2024-02-22', NULL, NULL, NULL, NULL, NULL, NULL, 'Размещение объявлений о поиске водителей и слесарей. ЛК 284285677. Расход за 01.01.24 - 22.02.24 5 256. 0,5 рублей за просмотр, 26 рублей за контакт. Счет № 01-1308460263 от 20.02.2024.  НДС 20% 5000', '4', NULL, 0, 5, NULL, 'ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ "РЭДВЭЙ"', 44525593, 'АО "АЛЬФА-БАНК" г Москва', NULL, 9703070488, 770301001, 30101810200000000593, 40702810902330003977, 40702810902330003977, NULL, NULL, '0', 0, 0, NULL, 'ООО "КЕХ ЕКОММЕРЦ"', 44525700, 'АО "Райффайзенбанк" г Москва', NULL, 7710668349, 997750001, 30101810200000000700, 40702810900001433830, 40702810900001433830, 'Платежное поручение', NULL, NULL, NULL, -30000.00, NULL, NULL, NULL),
	(12, 15906437819233688536, 10537225451196647706, 610657213164983908, 5994498775522591748, NULL, 17, 'электронно', '2024-03-01', NULL, NULL, '2024-03-01', NULL, NULL, NULL, NULL, NULL, NULL, 'Комиссия за обсл.счета за период с 01.03.24 по 31.03.24 по ПУ "Лучший Старт" Осн.тарифы Банка,НДС не облаг. ООО "РЭДВЭЙ"', '4670', NULL, 0, 5, NULL, 'ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ "РЭДВЭЙ"', 44525593, 'АО "АЛЬФА-БАНК"', NULL, 9703070488, 770301001, 30101810200000000593, 40702810902330003977, 40702810902330003977, NULL, NULL, '0', 0, 0, NULL, 'АО "Альфа-Банк"', 44525593, 'АО "АЛЬФА-БАНК"', NULL, 7728168971, 770801001, 30101810200000000593, 47422810402390025079, 47422810402390025079, 'Банковский ордер', NULL, NULL, NULL, -690.00, NULL, NULL, NULL),
	(12, 17748528463865735184, 6492966378922384069, 4430706372686820771, 5140550071452386012, NULL, 17, 'электронно', '2024-05-01', NULL, NULL, '2024-05-01', NULL, NULL, NULL, NULL, NULL, NULL, 'Комиссия за обсл.счета за период с 01.05.24 по 31.05.24 по ПУ "Лучший Старт" Осн.тарифы Банка,НДС не облаг. ООО "РЭДВЭЙ"', '4491', NULL, 0, 5, NULL, 'ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ "РЭДВЭЙ"', 44525593, 'АО "АЛЬФА-БАНК"', NULL, 9703070488, 770301001, 30101810200000000593, 40702810902330003977, 40702810902330003977, NULL, NULL, '0', 0, 0, NULL, 'АО "Альфа-Банк"', 44525593, 'АО "АЛЬФА-БАНК"', NULL, 7728168971, 770801001, 30101810200000000593, 47422810402390025079, 47422810402390025079, 'Банковский ордер', NULL, NULL, NULL, -690.00, NULL, NULL, NULL);

-- Дамп структуры для таблица bank_bot.data_properties
CREATE TABLE IF NOT EXISTS `data_properties` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `Property` varchar(20) CHARACTER SET cp1251 COLLATE cp1251_general_ci NOT NULL,
  PRIMARY KEY (`Id`),
  UNIQUE KEY `Property` (`Property`)
) ENGINE=InnoDB AUTO_INCREMENT=66 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Дамп данных таблицы bank_bot.data_properties: ~65 rows (приблизительно)
INSERT INTO `data_properties` (`Id`, `Property`) VALUES
	(1, 'ВидАккредитива'),
	(2, 'ВидОплаты'),
	(3, 'ВидПлатежа'),
	(4, 'Дата'),
	(5, 'ДатаОтсылкиДок'),
	(6, 'ДатаПоступило'),
	(7, 'ДатаСписано'),
	(8, 'ДополнУсловия'),
	(9, 'КвитанцияВремя'),
	(10, 'КвитанцияДата'),
	(11, 'КвитанцияСодержание'),
	(12, 'Код'),
	(13, 'КодНазПлатежа'),
	(14, 'НазначениеПлатежа'),
	(15, 'НазначениеПлатежа1'),
	(16, 'НазначениеПлатежа2'),
	(17, 'НазначениеПлатежа3'),
	(18, 'НазначениеПлатежа4'),
	(19, 'НазначениеПлатежа5'),
	(20, 'НазначениеПлатежа6'),
	(21, 'Номер'),
	(22, 'НомерСчетаПоставщика'),
	(23, 'ОКАТО'),
	(24, 'Очередность'),
	(25, 'ПлатежПоПредст'),
	(26, 'Плательщик'),
	(27, 'Плательщик1'),
	(28, 'Плательщик2'),
	(29, 'Плательщик3'),
	(30, 'Плательщик4'),
	(32, 'ПлательщикБанк1'),
	(33, 'ПлательщикБанк2'),
	(31, 'ПлательщикБИК'),
	(34, 'ПлательщикИНН'),
	(36, 'ПлательщикКорсчет'),
	(35, 'ПлательщикКПП'),
	(37, 'ПлательщикРасчСчет'),
	(38, 'ПлательщикСчет'),
	(39, 'ПоказательДаты'),
	(40, 'ПоказательКБК'),
	(41, 'ПоказательНомера'),
	(42, 'ПоказательОснования'),
	(43, 'ПоказательПериода'),
	(44, 'ПоказательТипа'),
	(45, 'Получатель'),
	(46, 'Получатель1'),
	(47, 'Получатель2'),
	(48, 'Получатель3'),
	(49, 'Получатель4'),
	(51, 'ПолучательБанк1'),
	(52, 'ПолучательБанк2'),
	(50, 'ПолучательБИК'),
	(53, 'ПолучательИНН'),
	(55, 'ПолучательКорсчет'),
	(54, 'ПолучательКПП'),
	(56, 'ПолучательРасчСчет'),
	(57, 'ПолучательСчет'),
	(58, 'СекцияДокумент'),
	(59, 'СрокАкцепта'),
	(60, 'СрокПлатежа'),
	(61, 'СтатусСоставителя'),
	(62, 'Сумма'),
	(63, 'УсловиеОплаты1'),
	(64, 'УсловиеОплаты2'),
	(65, 'УсловиеОплаты3');

-- Дамп структуры для таблица bank_bot.startsums
CREATE TABLE IF NOT EXISTS `startsums` (
  `Account_id` int(11) DEFAULT NULL,
  `StartSum` decimal(16,2) NOT NULL,
  `StartDate` date NOT NULL,
  KEY `Account_id` (`Account_id`),
  CONSTRAINT `startsums_ibfk_1` FOREIGN KEY (`Account_id`) REFERENCES `accounts` (`Id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- Дамп данных таблицы bank_bot.startsums: ~0 rows (приблизительно)
INSERT INTO `startsums` (`Account_id`, `StartSum`, `StartDate`) VALUES
	(12, 41972.60, '2024-01-24');

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
